http://blog.sina.com.cn/s/blog_4fbec8260102vj06.html
会议名称     时间       周期     前收           结束后点位       涨跌     涨跌幅
九届四次会议 2001.3.3-15 13天    1995.12        2022.6           27.48    1.38%
九届三次会议 2000.3.3-15 13天    1713.01        1681.47         -31.54   -1.84%
九届二次会议 1999.3.3-15 13天    1100.92        1166.93          66.01    6%
九届一次会议 1998.3.3-19 16天    1188.31        1188.72          0.41     0
八届五次会议 1997.2.27-3.15 17天 1031.51        1125.8           94.29    9.14%
八届四次会议 1996.3.3-3.17 15天 552.94          562.39           9.45     1.71%
八届三次会议 1995.3.3-3.18 16天 560.85          593.52           32.67    5.83%
八届二次会议 1994.3.8-3.22 15天 718.4           739.31           20.91    2.91%
八届一次会议 1993.3.14-3.31 18天 1236.37        925.91          -310.46   25.11%
七届五次会议 1992.3.18-4.3 17天 377.49          381.33           3.84     1.02%
七届四次会议 1991.3.23-4.9 18天 122.62          120.62          -2.84     1.63%
开会时间  会前低点  会中表现  会后高点  会后涨跌幅
1995.3.3-3.18 524 5.9%  681 15%
1996.3.3-3.17 512 1.8%  739 +31%
1997.2.27-3.15  895 9.1%  1510  34%
1998.3.3-3.19 1125  持平  1422  20%
1999.3.3-3.15 1064  5.8%  1210  4%
2000.3.3-3.15 1227  -1.8  2114  26%
2001.3.3-3.15 1893  1.8 2245  11%
2002.3.3-3.15 1339  7.8%  1693  5%
2003.3.3-3.18 1311  -3.4% 1649  13%
2004.3.3-3.14 1307  0.4 % 1783  5%
2005.3.3-3.14 1187  0.46% 1293  -2.99%
2006.3.3-3.14 1074  -2.02%  1757  2.46%
2007.3.3-3.15 2723  4.23% 4335  18.52%

从上述表格可以看出：
　　1、历年"两会"之前到之后的一段时间内(从1个月到4个月不等)，股指最低有15%左右以上的涨幅，80%以上的年份是有25%以上的涨幅。
　　2、两会结束之日起的一段时间内，股指上涨的概率为92.3%，幅度从4%到34%不等；仅有02年两会后股指下跌严重。
　　3、纵观过去的13年，在"两会"期间，大盘上涨了10次，下跌了3次，上涨概率为77%，不过不论上涨还是下跌，幅度均不大。
　　两会期间以及会后一段时间内股指以上升为主，那么受两会行情波及较深的历年三月股市行情又将是怎么样呢？
年份  2月收盘价 3月收盘价 当月涨幅(%)
2007  2881.07 3183.98 10.47
2006  1299.03 1298.295  -0.06
2005  1306.003  1181.236  -9.55
2004  1675.067  1741.623  3.97
2003  1511.932  1510.578  -0.09
2002  1524.701  1603.905  5.19
2001  1959.18 2112.775  7.84
2000  1714.578  1800.225  5.00
1999  1090.087  1158.054  6.23
1998  1206.53 1243.016  3.02
1997  1040.273  1234.617  18.68
1996  552.94  556.39  0.62
1995  549.26  646.92  17.78
1994  770.98  704.46  -8.63
1993  1339.88 925.91  -30.90
1992  364.66  381.24  4.55
1991  133.01  120.19  -9.64
　　
    从历年沪指3月的表现看，1993年、1991年、2005年、1994年跌幅较大。其中，1994年、1993年、2005年的A股市场都处在大级别下跌浪中。但1991年A股市场规模很小，借鉴意义不大。我们注意到，在386点至1558点、512点至2245点以及998点至今的三次大级别上涨浪中，沪指所跨越的3月份大多是上涨的，只有在1996年、2006年的3月分别上涨0.62和下跌0.06%。
　　
    为什么中国股市会有如此鲜明的"两会特色"呢？其实质性的原因主要基于以下几个方面：
　　一、"两会"的召开需要一个稳定、和谐、良好的氛围，而在某中程度上管理层也刻意地塑造这样的良好局面；
　　二、市场对"两会"的可能出台的政策有一个良好的心理预期，从而对大盘产生积极作用；
　　三、从市场角度来看，在"两会"前总有主力制造出领涨板块，带领不断上行。
　　
    每年"两会"前后，"两会"热点讨论的议题自然将成为市场炒作的题材，所涉及到的行业、上市公司会有所表现。兴业证券表示，具体而言，投资者可参与趋势确定的主题式投资。3月是重要的政治月，两会此期间进行，振荡中逢低吸纳与两会重要议题相关的主题概念，包括"医改"受益股、大农业、创业板概念等。

    从历年沪指3月的表现看，1993年、1991年、2005年、1994年的跌幅较大。其中，1994年、1993年、2005年的A股市场，都处在大级别下跌浪中。但1991年，A股市场规模很小，借鉴意义不大。我们注意到，在386点至1558点、512点至2245点、以及998点至今的三次大级别上涨浪中，沪指所跨越的3月份，大多数都是上涨的。只有在1996年、2006年的3月分别上涨0.62和下跌0.06%。A股市场既然以进入黄金十年，那么从历史规律看，2007年3月最坏也就是"克隆"1996年、2006年的走势。1997年3月，沪指上涨了18.68%，2007年3月有望"克隆"1997年3月的走势，"两会"期间应以做多为主。

研究要点：
　　根据对历次党代会、人大、政协两会对股市影响的统计分析，我们可以得出结论：会议的召开与股市没有直接的关系；
　　重要会议期间股市走势的最大影响因素是既有的股市走势，会议期间即使有一些利好政策出台，也不会改变股市既有的发展趋势；
　　根据历史分析，我们推断：所谓的十六大行情，其实只是投资者的一厢情愿
　　现在，市场瞩目的一个焦点就是中共十六大的召开，投资者对十六大充满期待。一般预计，按照中国股市政策市的特点，十六大的召开，会带来一波十六大行情。
鉴古可以知今。本报告试图回顾历次重要会议召开对股市的影响，以判断十六大行情的现实性。
　　我们的结论是：重要会议的召开与股市走势没有直接的关系。因此，所谓的十六大行情也许只是投资者的一厢情愿。

    第一部分 历年来的重要会议与股市走势
　　1．一般说明
　　本报告所指称的重要会议包括党代会及人大、政协两会；这应该说覆盖了所有的重要会议；
　　涨跌幅计算由分析家交易软件直接支持；
　　会议召开的起、止日如果是交易日，直接以之进行计算；起始日如果不是交易日，以该日之前的一个交易日进行计算；终止日如果不是交易日，以该日之后的一个交易日进行计算；
　　时间范围：从1992年到2002年。
　　具体数据参见：
附表1：党代会对股市的影响；
附表2：人大、政协两会对股市的影响；
附 图：重要会议与股市走势。

　　2．会议召开期间的股市走势
　　我们将中共全国代表大会和十四（五）大X中全会一起考虑，从1992年到2000年，共有会议12次（包括十四大和十五大），期间股市五次下跌，最大跌幅是十五大时的－4.68％；七次上涨，最大涨幅是1994年十五届四中全会期间的8.61％。
　　从1992年至今，中共召开了两次全国代表大会，即十四大和十五大，我们单独看十四大、十五大（这两届会议与十六大更具有可比性），1992年十四大召开期间，股市下跌4.22％；1997年十五大召开期间，股市下跌了4.68％，并没有对股市带来积极影响。
　　从1993年到2002年，人大、政协共召开代表大会十次。会议期间，股市八次上涨，最大涨幅为1997年年八届五次会议期间的12.31％；两次下跌，最大跌幅为1993年八届一次会议期间的－26.62％。
　　从党代会的召开可以很清楚地看出，会议的召开没有带来股市的走牛。两会召开期间，股市上涨次数较多。但是，我们不能以此判断存在一个两会行情。首先，十次会议两次次下跌，次数并不少，我们不能认为存在两会行情，而将之视为两会行情的反常现象。其次，两会期间股市上涨次数较多，主要原因是两会召开一般都在每年的三月份，而中国股市存在春节行情，年初上涨的次数较多，从而带动两会期间股市上涨。最后，从中国的实际情况看，党代会（特别是中共全国代表大会）一般比两会重要，如果党代会都没有带来什么行情，我们也很难相信两会会带来行情。

　　3．会议召开前一个月的股市走势
　　会不会存在会议行情的提前反应呢？我们选取会议召开前一个月的股市走势来作统计说明。实际操作中，我们也取了三个月的数据，但其效果跟取一个月的数据相同，因此，这里只以取一个月的数据为例。
　　会议召开前一个月，十二次党代会中，股市六次下跌，最大跌幅是十四大二中全会的－15.49％；六次上涨，最大涨幅是十四大四中全会的22.95％。十次两会中，股市七次上涨，最大涨幅是九届三次会议中的15.35％；三次下跌，最大跌幅八届一次中的－11.52％。
从上面的简单统计我们可以看出，股市不存在提前反映重要会议的现象。

　　4．会议召开后一个月的股市走势
　　那么，又会不会存在会议行情的滞后反映呢？我们选取会议召开后一个月的股市走势来做统计说明。跟前面所说的理由类似，我们也没有使用三个月的数据。会议召开后一个月，十二次党代会中，股市六次下跌，最大跌幅是1992年十四大召开后的－39.98％；六次上涨，最大涨幅是1993年十四大三中全会后的8.62％。十次两会中，股市两次下跌，最大跌幅为1994年八届二次会议后的－22.63％；八次上涨，最大涨幅是1993年八届一次会议后的41.83％。
　　我们从中也难以看到存在会议行情的滞后反映。

　　5．会议对股市影响的其他判断
　　上面我们是从会前，会后，会间的股市走势分别进行分析。那么，在一次会议召开的前、中、后，有没有什么特有的规律呢？我们可以进行横向的对比分析。
　　从附表1和附表2的数据可以看到，每次会议召开的前、中、后，股市走势涨跌互现，没有受到会议的任何影响，我们从中不能得到任何规律性的结论。

    第二部分 会有一波“十六大行情”吗？
　　一般说来，会议的召开之所以引起我们关注，是因为中国存在比较明显的政策市特征，政策对股市的影响很大。因此，人们直观地认为，作为反映政策变动的党代会、人大、政协会议的召开，会对股市走势产生影响。并且这种影响会是正面的。这也就产生了中国股市独有的“会议行情情结”。
　　但是，根据我们上面的统计分析，会议召开对股市基本上没有影响。根据历史判断所谓的“十六大行情”，我们可以说，这只是投资者的一厢情愿，不可能存在所谓的会议行情。

我们可以进一步分析其中的原因：
　　1）党代会、人大、政协两会虽然非常重要，通常会出台一些重要的政策。但是，这种政策一般都是宏观全局指导性的，对股市没有直接的影响。即使有影响，也只是间接的（可见附表1）。并且，这种重大政策是什么，在会议召开前很长一段时间，人们一般都会大致地能通过各种途径了解到。这些会议上出台的政策一般都会在人们的预期范围内，而不会超出人们的预期。
　　2）宏观全局指导性的政策，对股市的影响也是长期的，不会影响股市的中短期波动。所以，因为党代会、人大、政协两会的召开而预测股市上涨，通常不可靠。当然，党代会、人大、政协两会的召开，需要营造一些利好气氛。但是，这种利好气氛的营造，一般是通过股市政策来的，而不是通过这些会议。
　　3）从历次会议召开期间的股市走势判断，其最重要的影响因素是市场发展趋势。从附图中可以看出，历次会议召开时，股市走势都处于一定的发展趋势中，如果会议召开对股市有影响，召开时会出现一个拐点，市场将向相反方向变化，或者虽然沿着原来的方向发展，但发展速度发生变化。然而，从附图中可以看出，十二次党代会、十次两会的召开，没有一次出现在股市的拐点上，会议的召开并没有改变股市的发展趋势。

　　人们预测会出现“十六大行情”（以及其他会议行情），也许并不是期待十六大会出台什么利好政策，而是，人们预期，为了配合十六大的召开，证券主管部门很可能会出台一些利好政策，从而带动股市上涨。但是，根据上面的分析判断，即使是这种利好政策，也不会改变股市发展的趋势。
附表1：党代会对股市的影响
会议名称 召开时间 会期(天) 换届 重大人事变动 重大经济政策出台 涨跌幅（％）
会前1月 会间 会后1月
十四大(及一中) 92.10.12-19 8 √ 　 确立我国经济体制改革的目标是建立社会主义市场经济 －2.71 －4.22 －39.98
二中 93.3.5-7 3 　 　 通过《关于调整"八五"计划若干指标的建议》将国民经济增长速度由原定6%调整到8%-9% －15.49 4.36 －4.5
三中 93.11.11-14 4 　 　 通过《中共中央关于建立社会主义市场经济体制若干问题的决定》坚持以公有制为主体，多种经济共同发展的方针，进一步转换国有企业经营机制－3.03 6.88 8.62
四中 94.9.25-28 4 　 增补黄菊为中共中央政治局委员。增补吴邦国、姜春云为中共中央书记处书记 　 22.95 8.61 －22.15
五中 95.9.25-28 4 　 撤销陈希同中央政治局常委委员职务。增补张万年、迟浩田为中央军委副主席。 通过《中共中央关于制定国民经济和社会发展"九五"计划和2010年远景目标的建议》 －1.43 －2.58 2.02
六中 96.10-7-10 4 　 　 　 6.17 4.71 6.86
七中 97.9.6-9 4 　 　 　 4.62 －1.60 －10.58
十五大(及一中) 97.9.12-19 8 √ 　 提出公有制实现形式应当多样化，非公有制经济是我国社会主义市场经济的重要组成部分 2.08 －4.68 0.01
二中 98.2.25-26 2 　 　 　 －0.81 0.13 －0.49
三中 98.10.12-14 3 　 　 通过《中共中央关于农业和农村工作若干重大问题的决定》 2.76 0.25 4.03
四中 99.9.19-22 4 　 增补胡锦涛为中央军委副主席 通过《中共中央关于国有企业改革和发展若干重大问题的决定》提出首先要尽最大努力实现国有企业改革和脱困的三年目标 4.21 －1.73 －7.91
五中 00-10.9-11 3 　 　 通过《中共中央关于制定国民经济和社会发展第十个五年计划的建议》提出推动经济发展和结构调整必须依靠体制创新和科技创新 －1.81 1.23 7.09

附表2：人大、政协两会对股市的影响
会议名称 召开时间 会期(天) 换届 涨跌幅(%)
会前1月 会间 会后1月
八届一次 93.3.14-31 18 √ －11.52 －26.62 41.83
八届二次 94.3.8-22 15 　 8.83 2.91 －22.63
八届三次 95.3.3-18 16 　 4.36 4.39 5.39
八届四次 96.3.3-17 15 　 3.03 5.75 5.51
八届五次 97.2.27-3.15 17 　 7.48 12.31 17.69
九届一次 98.3.3-19 17 √ －0.22 0.03 8.55
九届二次 99.3.3-16 14 　 0.21 6.00 0.14
九届三次 00.3.3-16 14 　 15.35 －1.84 6.67
九届四次 01.3.3-15 13 　 －2.84 2.93 7.40
九届五次 02.3.3-15 13 　 0.73 6.31 －0.94

注：
1）14大、15大分别指中国***第14、15次全国代表大会；
2）14大后1－7中分别指14大1－7中全会；15大后1－5中分别指15大1－5中全会；
3）1997年前1－5次分别指全国人大、政协八届1－5次代表大会，1998年后1－5次分别指全国人大、政协九届1－5次代表大会。



library(plotly)

df <- read.csv("https://raw.githubusercontent.com/bcdunbar/datasets/master/iris.csv")



iris2<- iris
iris2$id <- factor(iris2$Species) %>% as.double
names(iris2) <- names(iris2) %>% stringr::str_replace("\\.","")
# frm_parcoords_plot(iris2,~Species)


p <- iris2 %>%
  plot_ly(type = 'parcoords',
          line = list(color = ~id,
                      colorscale = list(c(0,'red'),c(0.5,'green'),c(1,'blue'))),
          dimensions = list(
            list(range = c(2,4.5),
                 label = 'Sepal Width', values = ~SepalLength),
            list(range = c(4,8),
                 constraintrange = c(5,6),
                 label = 'Sepal Length', values = ~SepalWidth),
            list(range = c(0,2.5),
                 label = 'Petal Width', values = ~PetalLength),
            list(range = c(1,7),
                 label = 'Petal Length', values = ~PetalWidth)
            )
          )
p


p <- df %>%
  p
  plot_ly(type = 'parcoords',
          line = list(color = ~colorVal,
                      colorscale = 'Jet',
                      showscale = TRUE,
                      reversescale = TRUE
       ),
          dimensions = list(
            # list(range = c(2,4.5),
            #      label = 'Sepal Width', values = ~sepal_width),
            # list(range = c(4,8),
            #      constraintrange = c(5,6),
            #      label = 'Sepal Length', values = ~sepal_length),
            # list(range = c(0,2.5),
            #      label = 'Petal Width', values = ~petal_width),
            # list(range = c(1,7),
            #      label = 'Petal Length', values = ~petal_length)
            )
          )


library(plotly)

df <- read.csv("https://raw.githubusercontent.com/bcdunbar/datasets/master/parcoords_data.csv")

p <- df %>%
  plot_ly(width = 1000, height = 600) %>%
  add_trace(type = 'parcoords',
          line = list(color = ~colorVal,
                      colorscale = 'Jet',
                      showscale = TRUE,
                      reversescale = TRUE,
                      cmin = -4000,
                      cmax = -100),
          dimensions = list(
            list(range = c(~min(blockHeight),~max(blockHeight)),
                 constraintrange = c(100000,150000),
                 label = 'Block Height', values = ~blockHeight),
            list(range = c(~min(blockWidth),~max(blockWidth)),
                 label = 'Block Width', values = ~blockWidth),
            list(tickvals = c(0,0.5,1,2,3),
                 ticktext = c('A','AB','B','Y','Z'),
                 label = 'Cyclinder Material', values = ~cycMaterial),
            list(range = c(-1,4),
                 tickvals = c(0,1,2,3),
                 label = 'Block Material', values = ~blockMaterial),
            list(range = c(~min(totalWeight),~max(totalWeight)),
                 visible = TRUE,
                 label = 'Total Weight', values = ~totalWeight),
            list(range = c(~min(assemblyPW),~max(assemblyPW)),
                 label = 'Assembly Penalty Weight', values = ~assemblyPW),
            list(range = c(~min(HstW),~max(HstW)),
                 label = 'Height st Width', values = ~HstW),
            list(range = c(~min(minHW),~max(minHW)),
                 label = 'Min Height Width', values = ~minHW),
            list(range = c(~min(minWD),~max(minWD)),
                 label = 'Min Width Diameter', values = ~minWD),
            list(range = c(~min(rfBlock),~max(rfBlock)),
                 label = 'RF Block', values = ~rfBlock)
            )
          )





library(plotly)

df <- read.csv("d:/iris.csv")

p <- df %>%
  plot_ly(type = 'parcoords',
          line = list(color = ~species_id,
                      colorscale = list(c(0,'red'),c(0.5,'green'),c(1,'blue'))),
          dimensions = list(
            list(range = c(2,4.5),
                 label = 'Sepal Width', values = ~sepal_width),
            list(range = c(4,8),
                 constraintrange = c(5,6),
                 label = 'Sepal Length', values = ~sepal_length),
            list(range = c(0,2.5),
                 label = 'Petal Width', values = ~petal_width),
            list(range = c(1,7),
                 label = 'Petal Length', values = ~petal_length)
            )
          )

frm_parcoords_plot <- function(df_obj,group_column){
  colnames <-(df_obj%>%names)[1:4] 
  dims <-colnames%>%seq_along %>%
    llply(function(ix) list(range=df_obj[,ix]%>%range,label=colnames[ix],values=frm_gen_formula(colnames[ix]))
      )
  p <- df_obj%>%
    plot_ly(width = 1000, height = 600) %>%
    add_trace(type = 'parcoords',
            line = list(color = group_column,
                      colorscale = 'Jet',
                      showscale = TRUE,
                      reversescale = TRUE#,
                      # cmin = -4000,
                      # cmax = -100
                      ),
            dimensions = list(
              list(range = c(2,4.5),
                   label = 'Sepal Width', values = ~sepal_width),
              list(range = c(4,8),
                   constraintrange = c(5,6),
                   label = 'Sepal Length', values = ~sepal_length),
              list(range = c(0,2.5),
                   label = 'Petal Width', values = ~petal_width),
              list(range = c(1,7),
                   label = 'Petal Length', values = ~petal_length)
              )
            )
    p
}


# p$x$attrs[[1]]$dimensions[[1]] ## structure for dimensions
frm_gen_formula <- function(chr_col){
  paste("~",chr_col) %>%as.formula
}
frm_gen_formula("eee")


require(pryr)

"~sss" %>%as.formula
# df$sepal_width %>%range
frm_parcoords_plot(df,~species_id)

frm_parcoords_plot2 <- function(df_obj,group_column,scope){
  # frm_parcoords_plot2(iris2,~id,c(1:2))
  colnames <-(df_obj%>%names)[scope] 
  dims <-colnames%>%seq_along %>%
    llply(function(ix) list(range=df_obj[,ix]%>%range,label=colnames[ix],values=frm_gen_formula(colnames[ix]))
      )
  p <- df_obj%>%
    plot_ly(width = 1000, height = 600) %>%
    add_trace(type = 'parcoords',
            line = list(color = group_column,
                      colorscale = 'Jet',
                      showscale = TRUE,
                      reversescale = TRUE#,
                      # cmin = -4000,
                      # cmax = -100
                      ),
            dimensions = dims
            )
    p
}

# frm_parcoords_plot2(df,~species_id)

frm_parcoords_plot2(iris2,~id,c(1:2))